# Завдання: Основи баз даних та SQL
## Database Applications Development

**Медіна Центр кар'єри та технічної освіти**

---

## Огляд завдання (Task Overview)

У цьому завданні ви:
1. Завантажите та дослідите дані Titanic за допомогою **pandas**
2. Навчитесь вибирати колонки, фільтрувати та сортувати дані
3. Створите **SQLite database** (база даних SQLite)
4. Напишете **SQL queries** (SQL-запити) для аналізу даних

**Важливі терміни:**
- **DataFrame** = таблиця даних у Python (схожа на Excel)
- **Database** = організована колекція даних
- **SQL** = Structured Query Language (мова запитів до баз даних)
- **Query** = запит до бази даних

---

## Частина 1: Підготовка та завантаження даних
## Part 1: Setup and Data Loading

**Інструкції:**
1. Імпортуйте необхідні бібліотеки (libraries)
2. Завантажте датасет Titanic з CSV файлу
3. Перегляньте основну інформацію про дані

In [1]:
# Імпорт бібліотек (Import libraries)
import pandas as pd
import sqlite3

print("✅ Бібліотеки завантажено")

✅ Бібліотеки завантажено

In [2]:
# Завантаження датасету (Load dataset)
# CSV = Comma-Separated Values (файл з даними, розділеними комами)

titanic_df = pd.read_csv('Titanic Dataset.csv')

# Перевірка: скільки рядків (rows) і колонок (columns)?
print(f"Розмір датасету: {titanic_df.shape[0]} рядків, {titanic_df.shape[1]} колонок")
print(f"Назви колонок: {list(titanic_df.columns)}")

Розмір датасету: 1309 рядків, 14 колонок
Назви колонок: ['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

### Завдання 1.1: Огляд даних
### Task 1.1: Data Overview

Використайте методи pandas для ознайомлення з даними.

In [3]:
# Перегляньте перші 5 рядків (View first 5 rows)
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
# Отримайте інформацію про типи даних (Get data types info)
# info() показує: типи колонок, кількість непустих значень
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [5]:
# Отримайте статистичну інформацію (Get statistical summary)
# describe() показує: середнє, мінімум, максимум тощо
titanic_df.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

---

## Частина 2: Робота з DataFrame
## Part 2: Working with DataFrames

**Основні операції (Basic operations):**
- **Select columns** = вибір колонок
- **Filter rows** = фільтрація рядків
- **Sort data** = сортування даних
- **Calculate statistics** = обчислення статистики

### Завдання 2.1: Вибір колонок (Select Columns)

Виберіть тільки необхідні колонки з DataFrame.

In [6]:
# Виберіть колонки: Name, Age, Sex, Survived
# Синтаксис: df[['column1', 'column2', ...]]

passenger_info = titanic_df[['name', 'age', 'sex', 'survived']]
passenger_info.head()

                                              name    age     sex  survived
0                    Allen, Miss. Elisabeth Walton  29.00  female         1
1                   Allison, Master. Hudson Trevor   0.92    male         1
2                     Allison, Miss. Helen Loraine   2.00  female         0
3             Allison, Mr. Hudson Joshua Creighton  30.00    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00  female         0

In [7]:
# Ваше завдання: виберіть Name, Pclass, Fare
# Your task: select Name, Pclass, Fare

# НАПИШІТЬ КОД ТУТ (WRITE CODE HERE)

### Завдання 2.2: Фільтрація даних (Filter Data)

**Boolean indexing** = використання умов True/False для фільтрації.

**Оператори порівняння (Comparison operators):**
- `==` рівно (equal)
- `!=` не рівно (not equal)
- `>` більше (greater than)
- `<` менше (less than)
- `>=` більше або рівно (greater or equal)
- `<=` менше або рівно (less or equal)

In [8]:
# Знайдіть усіх пасажирів, які вижили (Survived = 1)
# Find all passengers who survived

survivors = titanic_df[titanic_df['survived'] == 1]
print(f"Кількість тих, хто вижив: {len(survivors)}")
survivors[['name', 'age', 'sex']].head()

Кількість тих, хто вижив: 500

                                            name    age     sex
0                  Allen, Miss. Elisabeth Walton  29.00  female
1                 Allison, Master. Hudson Trevor   0.92    male
5                            Anderson, Mr. Harry  48.00    male
6              Andrews, Miss. Kornelia Theodosia  63.00  female
8  Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female

In [9]:
# Знайдіть пасажирів старших за 30 років
# Find passengers older than 30

older_passengers = titanic_df[titanic_df['age'] > 30]
print(f"Пасажирів старших за 30: {len(older_passengers)}")
older_passengers[['name', 'age']].head()

Пасажирів старших за 30: 437

                                            name   age
5                            Anderson, Mr. Harry  48.0
6              Andrews, Miss. Kornelia Theodosia  63.0
7                         Andrews, Mr. Thomas Jr  39.0
8  Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0
9                        Artagaveytia, Mr. Ramon  71.0

In [10]:
# Ваше завдання: знайдіть усіх жінок (sex = 'female')
# Your task: find all female passengers

# НАПИШІТЬ КОД ТУТ

### Завдання 2.3: Кілька умов (Multiple Conditions)

**Логічні оператори (Logical operators):**
- `&` = AND (обидві умови мають бути True)
- `|` = OR (хоча б одна умова має бути True)

**ВАЖЛИВО:** Кожна умова має бути в дужках!

In [11]:
# Знайдіть жінок, які вижили
# Find female survivors

female_survivors = titanic_df[
    (titanic_df['sex'] == 'female') & 
    (titanic_df['survived'] == 1)
]

print(f"Жінок, які вижили: {len(female_survivors)}")
female_survivors[['name', 'age', 'pclass']].head()

Жінок, які вижили: 339

                                                 name   age  pclass
0                       Allen, Miss. Elisabeth Walton  29.0       1
6                   Andrews, Miss. Kornelia Theodosia  63.0       1
8       Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0       1
11  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0       1
12                      Aubart, Mme. Leontine Pauline  24.0       1

In [12]:
# Ваше завдання: знайдіть дітей (age <= 12), які вижили
# Your task: find children (age <= 12) who survived

# НАПИШІТЬ КОД ТУТ

### Завдання 2.4: Сортування (Sorting)

**sort_values()** = сортування DataFrame за колонкою.

**Параметри:**
- `ascending=True` = за зростанням (від меншого до більшого)
- `ascending=False` = за спаданням (від більшого до меншого)

In [13]:
# Сортуйте пасажирів за віком (від найменшого до найбільшого)
# Sort passengers by age (youngest first)

sorted_by_age = titanic_df.sort_values('age')
sorted_by_age[['name', 'age']].head(10)

                                         name   age
763   Dean, Miss. Elizabeth Gladys "Millvina"  0.17
747   Danbom, Master. Gilbert Sigvard Emanuel  0.33
1240          Thomas, Master. Assad Alexander  0.42
427                 Hamalainen, Master. Viljo  0.67
1111           Peacock, Master. Alfred Edward  0.75
657                    Baclini, Miss. Eugenie  0.75
658             Baclini, Miss. Helene Barbara  0.75
359             Caldwell, Master. Alden Gates  0.83
611                 Aks, Master. Philip Frank  0.83
548           Richards, Master. George Sibley  0.83

In [14]:
# Ваше завдання: сортуйте за Fare (від найбільшого до найменшого)
# Your task: sort by Fare (highest first)

# НАПИШІТЬ КОД ТУТ

### Завдання 2.5: Статистика (Statistics)

**Основні функції:**
- `.mean()` = середнє значення (average)
- `.min()` = мінімум
- `.max()` = максимум
- `.count()` = кількість непустих значень
- `.value_counts()` = скільки разів кожне значення зустрічається

In [15]:
# Обчисліть середній вік пасажирів
# Calculate average age

avg_age = titanic_df['age'].mean()
print(f"Середній вік: {avg_age:.1f} років")

Середній вік: 29.9 років

In [16]:
# Обчисліть відсоток виживання (survival rate)
# Calculate survival rate

survival_rate = titanic_df['survived'].mean() * 100
print(f"Відсоток виживання: {survival_rate:.1f}%")

Відсоток виживання: 38.2%

In [17]:
# Порахуйте кількість пасажирів у кожному класі
# Count passengers in each class

class_counts = titanic_df['pclass'].value_counts()
print("Кількість пасажирів за класами:")
print(class_counts)

Кількість пасажирів за класами:
pclass
3    709
1    323
2    277
Name: count, dtype: int64

In [18]:
# Ваше завдання: знайдіть середній вік тих, хто вижив
# Your task: find average age of survivors

# НАПИШІТЬ КОД ТУТ

---

## Частина 3: Створення бази даних
## Part 3: Creating a Database

**База даних (Database)** = організована колекція даних.

**SQLite** = легка база даних, яка зберігається в одному файлі.

**Чому бази даних краще, ніж CSV?**
- ✅ Перевірка даних (data validation)
- ✅ Безпека (security)
- ✅ Багато користувачів одночасно (multi-user access)
- ✅ Потужні запити (powerful queries)

### Завдання 3.1: Підключення до бази даних

**Connection** = з'єднання з базою даних.

In [54]:
# Створіть з'єднання з базою даних (або створіть нову)
# Create connection to database (or create new one)

conn = sqlite3.connect('titanic.db')
print("✅ З'єднання встановлено з titanic.db")

✅ З'єднання встановлено з titanic.db

### Завдання 3.2: Перетворення DataFrame в таблицю SQL

**Table** = таблиця в базі даних (схожа на DataFrame).

In [20]:
# Збережіть DataFrame у базу даних
# Save DataFrame to database

titanic_df.to_sql(
    name='passengers',      # Назва таблиці (table name)
    con=conn,               # З'єднання (connection)
    if_exists='replace',    # Якщо існує - замінити (if exists - replace)
    index=False             # Не зберігати індекс (don't save index)
)

print(f"✅ {len(titanic_df)} рядків збережено в таблицю 'passengers'")

✅ 1309 рядків збережено в таблицю 'passengers'

---

## Частина 4: SQL запити (SQL Queries)
## Part 4: SQL Queries

**SQL** = Structured Query Language (мова структурованих запитів).

**Основна структура SQL запиту:**
```sql
SELECT columns      -- Які колонки показати
FROM table          -- З якої таблиці
WHERE condition     -- Умова фільтрації (опціонально)
ORDER BY column     -- Сортування (опціонально)
LIMIT number;       -- Кількість рядків (опціонально)
```

### Завдання 4.1: SELECT - Вибір колонок

**SELECT** = вибрати дані з таблиці.

In [21]:
# Виберіть усі колонки, перші 5 рядків
# Select all columns, first 5 rows

query = """
SELECT *
FROM passengers
LIMIT 5
"""

result = pd.read_sql(query, conn)
result

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,None,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,None,NaN,"Montreal, PQ / Chesterville, ON"

In [22]:
# Виберіть тільки Name і Age
# Select only Name and Age

query = """
SELECT Name, Age
FROM passengers
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                              name    age
0                    Allen, Miss. Elisabeth Walton  29.00
1                   Allison, Master. Hudson Trevor   0.92
2                     Allison, Miss. Helen Loraine   2.00
3             Allison, Mr. Hudson Joshua Creighton  30.00
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  25.00
5                              Anderson, Mr. Harry  48.00
6                Andrews, Miss. Kornelia Theodosia  63.00
7                           Andrews, Mr. Thomas Jr  39.00
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00
9                          Artagaveytia, Mr. Ramon  71.00

In [23]:
# Ваше завдання: виберіть Name, Sex, Survived (перші 10 рядків)
# Your task: select Name, Sex, Survived (first 10 rows)

query = """
SELECT Name, Sex, Survived 
FROM passengers 
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                              name     sex  survived
0                    Allen, Miss. Elisabeth Walton  female         1
1                   Allison, Master. Hudson Trevor    male         1
2                     Allison, Miss. Helen Loraine  female         0
3             Allison, Mr. Hudson Joshua Creighton    male         0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female         0
5                              Anderson, Mr. Harry    male         1
6                Andrews, Miss. Kornelia Theodosia  female         1
7                           Andrews, Mr. Thomas Jr    male         0
8    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female         1
9                          Artagaveytia, Mr. Ramon    male         0

### Завдання 4.2: WHERE - Фільтрація

**WHERE** = умова для фільтрації рядків.

**ВАЖЛИВО:** Текстові значення мають бути в одинарних лапках: `'male'`, `'female'`

In [24]:
# Знайдіть пасажирів, які вижили
# Find survivors

query = """
SELECT Name, Age, Sex
FROM passengers
WHERE Survived = 1
LIMIT 10
"""

result = pd.read_sql(query, conn)
print(f"Знайдено {len(result)} рядків")
result

Знайдено 10 рядків

                                                name    age     sex
0                      Allen, Miss. Elisabeth Walton  29.00  female
1                     Allison, Master. Hudson Trevor   0.92    male
2                                Anderson, Mr. Harry  48.00    male
3                  Andrews, Miss. Kornelia Theodosia  63.00  female
4      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.00  female
5  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.00  female
6                      Aubart, Mme. Leontine Pauline  24.00  female
7                       Barber, Miss. Ellen "Nellie"  26.00  female
8               Barkworth, Mr. Algernon Henry Wilson  80.00    male
9    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.00  female

In [25]:
# Знайдіть чоловіків (Sex = 'male')
# Find male passengers

query = """
SELECT Name, Age, Sex
FROM passengers
WHERE Sex = 'male'
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                   name    age   sex
0        Allison, Master. Hudson Trevor   0.92  male
1  Allison, Mr. Hudson Joshua Creighton  30.00  male
2                   Anderson, Mr. Harry  48.00  male
3                Andrews, Mr. Thomas Jr  39.00  male
4               Artagaveytia, Mr. Ramon  71.00  male
5                Astor, Col. John Jacob  47.00  male
6  Barkworth, Mr. Algernon Henry Wilson  80.00  male
7                   Baumann, Mr. John D    NaN  male
8              Baxter, Mr. Quigg Edmond  24.00  male
9                  Beattie, Mr. Thomson  36.00  male

In [26]:
# Ваше завдання: знайдіть пасажирів першого класу (Pclass = 1)
# Your task: find first class passengers (Pclass = 1)

query = """
SELECT Name, Age, Sex
FROM passengers
WHERE Sex = 'male'
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                   name    age   sex
0        Allison, Master. Hudson Trevor   0.92  male
1  Allison, Mr. Hudson Joshua Creighton  30.00  male
2                   Anderson, Mr. Harry  48.00  male
3                Andrews, Mr. Thomas Jr  39.00  male
4               Artagaveytia, Mr. Ramon  71.00  male
5                Astor, Col. John Jacob  47.00  male
6  Barkworth, Mr. Algernon Henry Wilson  80.00  male
7                   Baumann, Mr. John D    NaN  male
8              Baxter, Mr. Quigg Edmond  24.00  male
9                  Beattie, Mr. Thomson  36.00  male

### Завдання 4.3: Кілька умов (Multiple Conditions)

**AND** = обидві умови мають бути істинними.

**OR** = хоча б одна умова має бути істинною.

In [27]:
# Знайдіть жінок, які вижили
# Find female survivors

query = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Sex = 'female' AND Survived = 1
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                                name   age     sex  survived
0                      Allen, Miss. Elisabeth Walton  29.0  female         1
1                  Andrews, Miss. Kornelia Theodosia  63.0  female         1
2      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female         1
3  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female         1
4                      Aubart, Mme. Leontine Pauline  24.0  female         1
5                       Barber, Miss. Ellen "Nellie"  26.0  female         1
6    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female         1
7                              Bazzani, Miss. Albina  32.0  female         1
8   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0  female         1
9                              Bidois, Miss. Rosalie  42.0  female         1

In [28]:
# Ваше завдання: знайдіть дітей (Age < 12), які вижили
# Your task: find children (Age < 12) who survived

query = """
SELECT Name, Age, Sex, Survived
FROM passengers
WHERE Sex = 'female' AND Survived = 1
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                                name   age     sex  survived
0                      Allen, Miss. Elisabeth Walton  29.0  female         1
1                  Andrews, Miss. Kornelia Theodosia  63.0  female         1
2      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0  female         1
3  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0  female         1
4                      Aubart, Mme. Leontine Pauline  24.0  female         1
5                       Barber, Miss. Ellen "Nellie"  26.0  female         1
6    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0  female         1
7                              Bazzani, Miss. Albina  32.0  female         1
8   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0  female         1
9                              Bidois, Miss. Rosalie  42.0  female         1

### Завдання 4.4: ORDER BY - Сортування

**ORDER BY** = сортування результатів.

**ASC** = за зростанням (ascending, за замовчуванням).

**DESC** = за спаданням (descending).

In [29]:
# Сортуйте пасажирів за віком (від найменшого)
# Sort passengers by age (youngest first)

query = """
SELECT Name, Age
FROM passengers
WHERE Age IS NOT NULL
ORDER BY Age
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                      name   age
0  Dean, Miss. Elizabeth Gladys "Millvina"  0.17
1  Danbom, Master. Gilbert Sigvard Emanuel  0.33
2          Thomas, Master. Assad Alexander  0.42
3                Hamalainen, Master. Viljo  0.67
4                   Baclini, Miss. Eugenie  0.75
5            Baclini, Miss. Helene Barbara  0.75
6           Peacock, Master. Alfred Edward  0.75
7            Caldwell, Master. Alden Gates  0.83
8          Richards, Master. George Sibley  0.83
9                Aks, Master. Philip Frank  0.83

In [30]:
# Сортуйте за ціною квитка (найдорожчі першими)
# Sort by fare (most expensive first)

query = """
SELECT Name, Fare, Pclass
FROM passengers
ORDER BY Fare DESC
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                                name      fare  pclass
0                 Cardeza, Mr. Thomas Drake Martinez  512.3292       1
1  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292       1
2                             Lesurer, Mr. Gustave J  512.3292       1
3                                   Ward, Miss. Anna  512.3292       1
4                     Fortune, Miss. Alice Elizabeth  263.0000       1
5                         Fortune, Miss. Ethel Flora  263.0000       1
6                         Fortune, Miss. Mabel Helen  263.0000       1
7                     Fortune, Mr. Charles Alexander  263.0000       1
8                                  Fortune, Mr. Mark  263.0000       1
9                Fortune, Mrs. Mark (Mary McDougald)  263.0000       1

In [31]:
# Ваше завдання: знайдіть 10 найстарших пасажирів
# Your task: find 10 oldest passengers

query = """
SELECT Name, Fare, Pclass
FROM passengers
ORDER BY Fare DESC
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                                name      fare  pclass
0                 Cardeza, Mr. Thomas Drake Martinez  512.3292       1
1  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292       1
2                             Lesurer, Mr. Gustave J  512.3292       1
3                                   Ward, Miss. Anna  512.3292       1
4                     Fortune, Miss. Alice Elizabeth  263.0000       1
5                         Fortune, Miss. Ethel Flora  263.0000       1
6                         Fortune, Miss. Mabel Helen  263.0000       1
7                     Fortune, Mr. Charles Alexander  263.0000       1
8                                  Fortune, Mr. Mark  263.0000       1
9                Fortune, Mrs. Mark (Mary McDougald)  263.0000       1

### Завдання 4.5: Комплексні запити
### Task 4.5: Complex Queries

Об'єднайте всі частини: SELECT, WHERE, ORDER BY, LIMIT.

In [32]:
# Знайдіть молодих чоловіків (< 18), які вижили, сортуйте за віком
# Find young males (< 18) who survived, sort by age

query = """
SELECT Name, Age, Sex, Pclass
FROM passengers
WHERE Sex = 'male' AND Age < 18 AND Survived = 1
ORDER BY Age DESC
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                              name   age   sex  pclass
0                      Thayer, Mr. John Borland Jr  17.0  male       1
1                   Sunderland, Mr. Victor Francis  16.0  male       3
2                       Svensson, Mr. Johan Cervin  14.0  male       3
3                      Ryerson, Master. John Borie  13.0  male       1
4                     Nicola-Yarred, Master. Elias  12.0  male       3
5              Carter, Master. William Thornton II  11.0  male       1
6            Coutts, Master. Eden Leslie "Neville"   9.0  male       3
7  Goldsmith, Master. Frank John William "Frankie"   9.0  male       3
8                        Olsen, Master. Artur Karl   9.0  male       3
9                   Davies, Master. John Morgan Jr   8.0  male       2

In [33]:
# Ваше завдання: знайдіть жінок першого класу (Pclass = 1),
# які заплатили більше $50, сортуйте за ціною (найдорожчі першими)
# Your task: find first class females who paid more than $50,
# sort by fare (most expensive first)

query = """
SELECT pclass, sex, fare
FROM passengers
WHERE Sex = 'female' AND pclass=1 AND fare > 50
ORDER BY Fare DESC
"""

result = pd.read_sql(query, conn)
result

     pclass     sex      fare
0         1  female  512.3292
1         1  female  512.3292
2         1  female  263.0000
3         1  female  263.0000
4         1  female  263.0000
..      ...     ...       ...
117       1  female   52.0000
118       1  female   52.0000
119       1  female   51.8625
120       1  female   51.4792
121       1  female   51.4792

[122 rows x 3 columns]

---

## Частина 5: Порівняння pandas і SQL
## Part 5: Comparing pandas and SQL

Напишіть той самий запит двома способами.

### Завдання 5.1: Знайдіть дорослих жінок, які вижили

**Pandas спосіб:**

In [34]:
# Pandas: дорослі жінки (Age >= 18), які вижили
result_pandas = titanic_df[
    (titanic_df['sex'] == 'female') & 
    (titanic_df['age'] >= 18) & 
    (titanic_df['survived'] == 1)
][['name', 'age', 'pclass']].head(10)

print("Результат pandas:")
display(result_pandas)

Результат pandas:

                                                 name   age  pclass
0                       Allen, Miss. Elisabeth Walton  29.0       1
6                   Andrews, Miss. Kornelia Theodosia  63.0       1
8       Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0       1
11  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0       1
12                      Aubart, Mme. Leontine Pauline  24.0       1
13                       Barber, Miss. Ellen "Nellie"  26.0       1
17    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0       1
18                              Bazzani, Miss. Albina  32.0       1
21   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0       1
23                              Bidois, Miss. Rosalie  42.0       1

**SQL спосіб:**

In [35]:
# SQL: той самий запит
query = """
SELECT Name, Age, Pclass
FROM passengers
WHERE Sex = 'female' AND Age >= 18 AND Survived = 1
LIMIT 10
"""

result_sql = pd.read_sql(query, conn)
print("Результат SQL:")
display(result_sql)

Результат SQL:

                                                name   age  pclass
0                      Allen, Miss. Elisabeth Walton  29.0       1
1                  Andrews, Miss. Kornelia Theodosia  63.0       1
2      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0       1
3  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0       1
4                      Aubart, Mme. Leontine Pauline  24.0       1
5                       Barber, Miss. Ellen "Nellie"  26.0       1
6    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0       1
7                              Bazzani, Miss. Albina  32.0       1
8   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0       1
9                              Bidois, Miss. Rosalie  42.0       1

### Завдання 5.2: Ваше порівняння

Знайдіть пасажирів третього класу, які заплатили менше $10.

Напишіть запит **обома способами**.

In [36]:
# Pandas спосіб:
# НАПИШІТЬ КОД ТУТ

In [37]:
# SQL спосіб:
query = """
SELECT Name, Age, Pclass
FROM passengers
WHERE Sex = 'female' AND Age >= 18 AND Survived = 1
LIMIT 10
"""

result = pd.read_sql(query, conn)
result

                                                name   age  pclass
0                      Allen, Miss. Elisabeth Walton  29.0       1
1                  Andrews, Miss. Kornelia Theodosia  63.0       1
2      Appleton, Mrs. Edward Dale (Charlotte Lamson)  53.0       1
3  Astor, Mrs. John Jacob (Madeleine Talmadge Force)  18.0       1
4                      Aubart, Mme. Leontine Pauline  24.0       1
5                       Barber, Miss. Ellen "Nellie"  26.0       1
6    Baxter, Mrs. James (Helene DeLaudeniere Chaput)  50.0       1
7                              Bazzani, Miss. Albina  32.0       1
8   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0       1
9                              Bidois, Miss. Rosalie  42.0       1

---

## Частина 6: Аналітичні запитання
## Part 6: Analytical Questions

Використайте SQL, щоб відповісти на ці запитання.

### Питання 1: Скільки дітей (Age < 12) було на кораблі?

**Підказка:** Використайте COUNT(*) у SQL

In [38]:
query = """
SELECT COUNT(*) as total_children
FROM passengers
WHERE Age < 12
"""

result = pd.read_sql(query, conn)
print(f"Кількість дітей: {result['total_children'][0]}")

Кількість дітей: 91

### Питання 2: Хто заплатив найдорожчий квиток?

**Підказка:** Використайте ORDER BY Fare DESC LIMIT 1

In [39]:
# НАПИШІТЬ SQL ТУТ
query = """
SELECT Fare 
FROM passengers
ORDER BY Fare DESC
LIMIT 1 
"""


result = pd.read_sql(query, conn)
result

       fare
0  512.3292

### Питання 3: Скільки чоловіків і скільки жінок вижило?

**Підказка:** Використайте GROUP BY

In [40]:
query = """
SELECT Sex, COUNT(*) as survivors
FROM passengers
WHERE Survived = 1
GROUP BY Sex
"""

result = pd.read_sql(query, conn)
result

      sex  survivors
0  female        339
1    male        161

### Питання 4: Яка середня ціна квитка для кожного класу?

**Підказка:** Використайте AVG() та GROUP BY

In [41]:
# НАПИШІТЬ SQL ТУТ
query = """
SELECT Sex, COUNT(*) as survivors
FROM passengers
WHERE Survived = 1
GROUP BY Sex
"""

result = pd.read_sql(query, conn)
result

      sex  survivors
0  female        339
1    male        161

### Питання 5: Знайдіть п'ятьох наймолодших пасажирів, які НЕ вижили

In [55]:
# НАПИШІТЬ SQL ТУТ
query = """
SELECT Sex, COUNT(*) as survivors
FROM passengers
WHERE Survived = 1
GROUP BY Sex
"""

result = pd.read_sql(query, conn)
result

      sex  survivors
0  female        339
1    male        161

---

## Завершення роботи
## Finishing Up

In [56]:
# ЗАВЖДИ закривайте з'єднання після роботи!
# ALWAYS close connection when done!

conn.close()
print("✅ З'єднання закрито")

✅ З'єднання закрито

---

## Підсумок (Summary)

### Ви навчилися:

**Pandas:**
- ✅ Завантажувати та досліджувати дані
- ✅ Вибирати колонки: `df[['col1', 'col2']]`
- ✅ Фільтрувати рядки: `df[df['age'] > 30]`
- ✅ Сортувати: `df.sort_values('column')`
- ✅ Обчислювати статистику: `.mean()`, `.count()`

**SQL:**
- ✅ Створювати базу даних SQLite
- ✅ Конвертувати DataFrame в SQL таблицю
- ✅ SELECT - вибір колонок
- ✅ WHERE - фільтрація рядків
- ✅ ORDER BY - сортування
- ✅ Комбінувати кілька умов (AND, OR)

**Ключова ідея:**
Pandas і SQL роблять те саме, просто різним синтаксисом!

---

## Довідка: Порівняння команд
## Reference: Command Comparison

| Операція | Pandas | SQL |
|----------|--------|-----|
| Вибрати колонки | `df[['name', 'age']]` | `SELECT name, age FROM table` |
| Фільтрація | `df[df['age'] > 30]` | `WHERE age > 30` |
| Сортування | `df.sort_values('age')` | `ORDER BY age` |
| Перші N рядків | `df.head(10)` | `LIMIT 10` |
| І (AND) | `(cond1) & (cond2)` | `cond1 AND cond2` |
| Або (OR) | `(cond1) | (cond2)` | `cond1 OR cond2` |
| Рівність | `df['col'] == value` | `col = value` |
| Середнє | `df['col'].mean()` | `AVG(col)` |
| Підрахунок | `df['col'].count()` | `COUNT(col)` |

---

## Submission / Здача роботи

1. **Переконайтеся**, що всі комірки виконано
2. **Збережіть** файл: `File → Save Notebook`
3. **Додайте** до GitHub:
   ```bash
   git add dbApps_CompleteTask_UA.ipynb
   git commit -m "Complete database applications task"
   git push origin main
   ```
4. **Перевірте** на GitHub, що файл завантажився

**Гарної роботи! Good luck!** 🚀